app/controllers/creatures_controller.rb

	def index
		#gel all creatures from db and sav to instance variables
		@creatures = Creature.all
---
SELECT "creatures".* FROM "creatures"

	def create
		#whitelist(designate what's acceptable) for the params of the new creatures
		creature_params = params.require(:creature).permit(:name, :description)
		#create the creature using the params variable
		creature = Creature.new(creature_params)
		if creature.save
---
INSERT INTO "creatures" ("name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Manticore"], ["description", "Bad ass lion thing with a scorpion tail."], ["created_at", "2016-01-09 20:36:29.627273"], ["updated_at", "2016-01-09 20:36:29.627273"]]

	def show
		#get the selected creature
		creature_id = params[:id]

		#fid said creature and save it
		@creature = Creature.find_by_id(creature_id)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 1]]

	def update
		creature_id = params[:id]
		creature = Creature.find_by_id(creature_id)
		creature_params = params.require(:creature).permit(:name, :description)
		creature.update_attributes(creature_params)
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 5]]
UPDATE "creatures" SET "description" = ?, "updated_at" = ? WHERE "creatures"."id" = ?  [["description", "Big AND SCARY reptile that deploys a breath weapon"], ["updated_at", "2016-01-09 22:33:36.880109"], ["id", 5]]

	def destroy
		creature_id = params[:id]
		creature = Creature.find_by_id(creature_id)
		creature.destroy
---
SELECT  "creatures".* FROM "creatures" WHERE "creatures"."id" = ? LIMIT 1  [["id", 5]]
DELETE FROM "creatures" WHERE "creatures"."id" = ?  [["id", 5]]